ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_КлючиМоделей/АСМ_КлючиМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_КлючиМоделей</name>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БезМарки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезМаркиБезМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Совместимо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_КлючиМоделей/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьВидимостьЭлементов();
	УстановитьОтборыСписка();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МаркаПриИзменении(Элемент)

	УстановитьВидимостьЭлементов();
	УстановитьОтборыСписка();

КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)

	УстановитьВидимостьЭлементов();
	УстановитьОтборыСписка();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()

	Если Модель <> ПредопределенноеЗначение("Справочник.АСМ_Модели.ПустаяСсылка") Тогда

		Элементы.Наименование.Видимость = Ложь;
		Элементы.БезМарки.Видимость = Ложь;
		Элементы.БезМаркиБезМодели.Видимость = Истина;

	ИначеЕсли Марка <> ПредопределенноеЗначение("Справочник.АСМ_Марки.ПустаяСсылка") Тогда

		Элементы.Наименование.Видимость = Ложь;
		Элементы.БезМарки.Видимость = Истина;
		Элементы.БезМаркиБезМодели.Видимость = Ложь;

	Иначе

		Элементы.Наименование.Видимость = Истина;
		Элементы.БезМарки.Видимость = Ложь;
		Элементы.БезМаркиБезМодели.Видимость = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыСписка()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Марка",
																			Марка,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Марка));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Модель",
																			Модель,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(Модель));
КонецПроцедуры

#КонецОбласти
